[{"title":"我的2017年度音乐报告 - 上篇","date":"2018-01-03T14:44:35.000Z","path":"2018/01/03/2017-music-1/","text":"2017年就这样过去了，仿佛写16年音乐报告也是没多久之前的事情。因为今年大四了，下半年几乎都在实习，在陌生的公司环境里，好像音乐也听的更多了。。 今年听过比较多的都单独存了一个歌单，先放个链接 KOKIA - moment17年一月份，KOKIA第二次来到上海。（之前那次因为各种原因就是没去成。。这次就不能放过这个机会了）地点是在美琪大剧院，当天满怀着期待去听了KOKIA的演出，但全程听完后，当时的心情坦白来说。。是有点失望的。一是唱了很多我没有听过的歌，二是美琪大剧院根本就不是个专门给音乐演出的场所，音响效果很烂…之后在贴吧了解了相关信息才知道，KOKIA的演出是不会唱ACG相关的曲目的，而且一般都是唱最近几年新发型的新歌为主，我之前一直在听老专辑所以很多就没听过。。要说这次演唱会最大的收获莫过于现场演唱的本当之音，moment这张专辑我之前是没有听过的，但在演唱会之后，那首歌便一直余音绕梁，致使我整个一月份都在循环moment这张专辑。。（BTW这张专辑的初回限定版是录制本专辑时的录像，很值得一看） kokia的歌曲除了无与伦比的硬实力声线，真正打动人心的还是莫过于走心的歌词。虽说是一种典型的日式鸡汤，但通过kokia的歌声传递出来之后，便显得格外充满力量。比如这张专辑里我最喜欢的《from 16》，无论是伴奏风琴的音色还是歌词所蕴含的意义，都几乎是完美了。短短几句歌词就可以让一个处于低谷的人找到努力的意义。 人はそう 人の幸せを自分のことのように感じて 是因为人类就是 将别人的幸福幻想成自己的 前に進んで行けるから 就有了前进的动力 それぞれが自分の行き方を通して 通过每个人自己的方式 誰かにきっと 幸せ分けて歩いて いるんだろう 不论是谁 一定有着迈向格外幸福的方式吧 そうやって みんなで歩いて行く 那样做的话 大家就能一起迈步向前 再比如这首非常柔和的《大丈夫 だいじょうぶ》。正如歌名一样，在无数个烦恼和孤独的时刻，听到这首歌便会觉得，“啊，人生还是有希望的”。だいじょうぶ，だいじょうぶ。 どこかで知っているけれど 虽然我知道 「大丈夫」 そう誰かに言ってほしかったの 可还是想让某个人说声“放心吧” 「大丈夫」 そうあなたに言ってほしかったの 还是想让你说声“放心吧” 「大丈夫」 そうあなたに言ってほしかったの… 还是想让你说声“放心吧” 整张专辑的歌都很棒，篇幅原因不一一表述了，有兴趣的可以看一下上面的录音视频，非常推荐。 我承认在刚听完演唱会当天晚上是感到失望的，可之后发现我之前对k姐的认识还是太少，甚至还停留在ありがとう那首歌的印象。虽说songbird那张专辑确实很棒，但经过这么多年了，听了她近年的专辑之后越发觉得kokia是不满足于只创作好听的音乐，她是真的想在作品里传递love &amp; peace这个观念。songbird里的kokia是那种小家碧玉有点古灵精怪的感觉，声线也非常嫩。然而近年的新专辑根本就没再出现那种风格，取而代之的是更加回归自然的音色，和立意更高的歌词，和刚出道时简直是两个境界。。这种歌手一旦喜欢上便很难丢下了。 17年12月KOKIA又来了一次魔都，一年之内来两次中国也是挺稀奇的，这次因为是周日演出，时间关系我也没去参加，贴吧里看了演出歌单很多是新专辑动物园里的曲子，看来又要开始补课了呀233。 Ludovico Einaudi - Divenire17年四月，鲁叔又来中国巡演了，上一次来演出的时候很惭愧我还不认识他。。（相信绝大部分人都是看了无法触碰才了解他的吧）这次听到来华的消息还是很激动的，便约了同学一起去听了。 演出场地在东方艺术中心的音乐厅，非常专业，比美琪大剧院不知道高到哪里去了。虽然买的是最便宜的180元位子，但运气真的超级好，正好坐在乐队演出的后方，离现场非常近。 作为新古典风格的音乐（况且鲁叔最近的几张专辑都很有实验的风格。。），现场除了钢琴，鼓之外还有很多奇怪的乐器，有个好像是把音叉放在水箱里的乐器我到现在也不知道是什么东西。查了下好像是为了模拟深海的氛围之类的。总之乐队素质相当专业，音响效果也很棒，演出曲目大部分是经典曲目，其中有一段鲁叔个人独奏，好几段名曲无缝连接，听得十分醉。当时的现场就是那种全场一片漆黑，只有一束光从上方打在钢琴前的鲁叔，不禁让我想起王千源在《钢的琴》里那段雪中独奏致爱丽丝，十分浪漫，十分文艺。 话说回到这张专辑，最喜欢的一首是时间最长的《Oltremare》。同样也是一首钢琴独奏曲。不知用何种语言描述这支乐曲，只不过是听了就会让人思绪放松，并唤起过往美好的记忆，无法自拔。 当时在听了这两场音乐会之后我便给自己定下了一个评判音乐会的标准：是否能在听完音乐会后更多的了解这个歌手？KOKIA和ludovico都是如此，在听过他们的现场之后是更加全面的了解他们，演出会吸引观众去发现他们之前没有听过的作品，这便是很成功了。很庆幸的是目前听过的演出大部分都让我更加喜欢他们了。 Childschilds这张专辑可谓是后摇里相当相当地经典了，由于17年去听了他们的现场演出还是想单独拿出来提一提。 演出地点在浅水湾，现场效果不敢恭维，音响很糊，作为后摇演出肯定是不合格的了。开场时乐队迟到了半个多小时也不知是何原因，演出前的寒暄貌似提到了乐队成员有人生病了，唉也是运气不够好。 现场大部分曲目都来自于yui这张专辑，个别是新专辑，不过我也没听过就是…整场氛围其实不是很欢腾，毕竟这种后摇嘛，适合一个人孤独的听，体会氛围即可。不过当乐队演奏mariana的时候，现场气氛还是迎来了高潮，所谓電気童话，莫过于此了。 在我前几年刚听这张专辑的时候，最喜欢的也是mariana，然而最近却是Ian p听得更多，至于原因就是它表达的情绪更加激烈或者说更加灰暗一点，而其中采样的明日香的台词也一定程度上促使我在今年补完了EVA这个神作，又进了另一个大坑，年度总结下篇里应该都会是鹭巢诗郎了（ BTW childs演出那天正好也是kashiwa daisuke来上海演出。。这么巧这两个我喜欢的音乐人在一天撞车，kashiwa daisuke14年第一次来上海的演出我去了，那也是我人生中参加的第一个演出现场，现在想想都已经过去这么多年了（ 崔健 - 一无所有去年通过暮春秋色熟悉了窦唯，今年则是有段时间天天循环崔健。我发现摇滚这种形式的音乐，还是母语听着比较带感，听着就情不自禁得想跟着唱（可惜崔健的歌太难唱了，只能瞎哼哼。。） 你问我要去向何方 我指着大海的方向 你的惊奇像是给我 噢 一个赞扬 ……….. 你要我和它们一样 我看着你默默地说 噢 不能这样 我想要回到老地方… 我想要走在老路上… –《花房姑娘》 作为一个没事就想跑到海边的人来说，这几句歌词真是太符合我的性格了。 我热爱大海，热爱天空，想和大雄一样没事就一个人跑到后山里发呆，可现实的我们还是得在城市里的闳宇崇楼忙碌着：（。 话说有一天在家听《新长征路上的摇滚》的时候，我妈跟我说这是她小时候听的歌，不仅感叹优秀的作品不管经过多少年都还是会闪烁着光芒，吸引着后来的人们去了解。 朴树 - 猎户星座身为95后的我，在朴树最辉煌的那个时代，并没有太大的感触。再次关注朴树时还是韩寒处女座《后会无期》里听到他演唱的片尾曲《平凡之路》，事实上这首歌也是朴树沉寂了十多年后再次回到大众视野里的复出之作。 17年，朴树发布了猎户星座这张全新专辑，其中不仅收录了近年来给电影作的主题曲，也有《空帆船》，《Never knows tomorrow》这样的新曲。网上有句传烂的话叫做「愿你出走半生，归来仍是少年」，用在朴树这张专辑身上，倒是再合适不过了。 当我听到 风从我耳旁呼啸着掠过 那一刻我的心狂喜着猛烈地跳动 我爱这艰难又拼尽了全力的每一天 我会怀念所有的这些曲折 让我半醉半醒地游荡在我的命运中 让我跟随着她的起伏与她共舞 我爱这被风带走不会再有的每一天 那只有我自己知道的快乐 —-《空帆船》 去年暑假里的某一天，坐在公交车上听着耳机里传来的「我迎着风」，看着窗外流动的景色，心绪也仿佛搭上了一艘空帆船，驶向了远方。编曲，氛围，歌词都太棒了。 我相信朴树他一定是经历过什么才能写得出这么有真情实感的歌词。我记得大二时和同学早上三四点汽车去看日出的时候，沿着海岸线骑行时，头顶上的天空渐渐变得明朗，出现极光形状气辉的时候，那一刻我的心正如歌词里写的那样狂喜着猛烈地跳动。虽然那次运气不好，云太多没有看到海上日出，但那种骑着车迎着风的心情大概是永生难忘了。 17年总结上篇暂时就先写这么多了，下篇应该会大力介绍鹭巢诗郎，毕竟整个17下半年我都在循环eva和蓝宝石之谜的OST。。真的是巨坑。。","tags":[{"name":"music","slug":"music","permalink":"http://yoursite.com/tags/music/"}]},{"title":"老手机的重生","date":"2017-08-30T11:16:52.000Z","path":"2017/08/30/flashphone/","text":"我人生中第一部手机便是索尼的LT26ii，被索尼高颜值冲昏了头的我在13年买了这部12年出的手机。我也没想到这手机一用就是四年，到了17年的今天我还在使用。刚买回来那时候还是挺爱惜的，也很热衷于刷机，然而过了差不多半年再我刷了安卓4.1之后就再也不想去折腾这手机了，也一直用到了现在。 可这手机配置就摆在这里，时至今日在国产APP众多流氓的压迫下，1g内存真的很不够用，甚至连最基本的通话功能有时候都会出现故障（接电话时只能通过免提听到声音）。这不禁加深了我想要换手机的念头，好巧不巧几天前偶然间逛了四年前上的机锋论坛，大吃一惊，怎么这手机还能上安卓7.1的？？原来现在还有很多开发者在继续更新新的ROM啊。。 反复参考了刷机教程（虽然图都失效了，好在文字过程还算详细）之后，备份好四年间存下来的照片联系人信息什么的，毅然决然地准备刷掉这四年来没有动过的系统。 刷机过程还算顺利，13年大家还是用的recovery来刷机，到现在都换成了twrp了。用Flashtool刷入twrp还算简单，可刷过后问题来了，电脑上的adb无法识别此设备，在设备管理器里Xperia设备旁也是一个黄色感叹号的标志，看来是驱动没了。。然而装了Flashtool自带的驱动包后还是无解。。网上查阅了很多信息，但由于手机型号久远用户数量少的缘故，并没有找到什么有用的信息，无非是USB线坏了，换个USB口之类的方法。。抱着死马当活马医的心态下了刷机精灵，想依靠这软件，至少能让我手机刷进去原来的系统也行啊。。可没想到驱动精灵倒是装了个驱动让adb成功识别了手机，，现在插上手机设备管理器是这样显示的。 既然能用adb了那之后便是按照步骤来一步一步进行即可，合并分区，把rom包push进SD卡，开始刷。看着开机后安卓7的开机动画，竟有点恍惚，原来这12年配置的手机也能上7.1啊。。好像安卓7对于应用后台管理和权限之类的更加严格了，用起来比之前四年垃圾碎片积累下的老系统还是顺畅很多的。试了下bilibili竟然也能差不多流畅的播放视频… 总而言之这部手机现在就像重生了一样，大概还能撑到Xperia xz1 compact出来233。反正对于我不玩手游的人来说能打电话发短信刷论坛，有这些功能就足够了。。","tags":[{"name":"手机","slug":"手机","permalink":"http://yoursite.com/tags/手机/"},{"name":"折腾","slug":"折腾","permalink":"http://yoursite.com/tags/折腾/"}]},{"title":"小小的笔记","date":"2017-08-29T12:06:33.000Z","path":"2017/08/29/20170829/","text":"记录一些实习练习中遇到的小问题，权当笔记。 1. 验证邮件地址12345var mail_address = $(\"#Email\").val(); //jquery选择器var regexEmail = /^([0-9A-Za-z\\-_\\.]+)@([0-9a-z]+\\.[a-z]&#123;2,3&#125;(\\.[a-z]&#123;2&#125;)?)$/g;if (!regexEmail.test(mail_address)) &#123; alert(\"邮箱地址有误!\");&#125; 说起来在我高中第一次接触到JavaScript的时候，我根本不知道正则表达式这个概念，当时看到这些像乱码一样的代码，也只是死记硬背了下来。。现在看来这个还是非常有必要去学习的。另附几个常用的表单验证正则。 2. 不要忘记在数据库里添加自增序列12345@Id@Column(name = \"ID\")@SequenceGenerator(name = \"SEQ_XXBS_FWXX_ID\", allocationSize = 1, sequenceName = \"SEQ_XXBS_FWXX_ID\")@GeneratedValue(strategy = GenerationType.SEQUENCE, generator = \"SEQ_XXBS_FWXX_ID\")private Integer id; 通常用于ID的自动自增。 3. 简单的触发器1234567891011create or replace trigger fwxx_sj_sync before insert on t_xxbs_fwxx for each rowdeclare -- local variables herebegin if :new.xgsj is null then :new.xgsj:=sysdate; :new.xgr:=:new.cjr; end if;end fwxx_sj_sync; 原本是保存数据的时候只会保存创建时间和创建人，表里的修改时间和修改人在进行修改删除操作之前是空的，后来想到可以用触发器在插入数据的时候顺便把创建时间创建人赋为修改的初值。于是参考了网上的例子，主要是熟悉了:new关键字的使用。 4. 将sysdate转为给正常人看的日期格式1to_char(birth,'yyyy\"年\"fmmm\"月\"dd\"日\"') --birth为一个date类型，直接保存了sysdate 关键在于fm，如果不加的话，8月会显示为08月，还是有点违和的。 5. JavaScript中把datepicker取到的字符串存为Date类型12var tmp = $(\"#birth\").val();var birth = new Date(Date.parse(tmp.replace(/-/g, \"/\"))); datepicker插件取到的就是类似2017-08-29之类的字符串，然而我在后台把birth定义为了Date类型，本来是想在后台把Date换成String算了，后来一查发现在前端保存的时候换成Date类型这样修改更加方便。。","tags":[{"name":"note","slug":"note","permalink":"http://yoursite.com/tags/note/"}]},{"title":"2016年伴随我的十佳专辑","date":"2017-01-17T05:47:02.000Z","path":"2017/01/17/2016-music/","text":"不知不觉2016都已经过去了，果然是随着年纪的增长，对时间流逝的敏感度降低了吗。过去的这一年，似乎比以往都更加的需要音乐的陪伴，自然也是听了许多新专老专，值此之际，姑且就记录一下16年陪伴在我耳边的这十张一直在循环的专辑吧。 https://www.douban.com/note/600636245/ 1. KASHIWA Daisuke - program music II我初识柏大輔便是因为program music I专辑中那首长达三十六分钟的Stella。当时还是高中生的我头一次听到器乐种类如此复杂，变化如此多端的音乐形式，感到了莫大的震撼。也正是因为这首歌我算是入了后摇这个坑。所以今年上半年在他的官网看到program music系列时隔十年竟然要出II实在是无比的兴奋。经过了十年，这张专辑较之I显得更为沉稳，Stella中的实验元素少了很多，取而代之的是很多新古典元素（？）。 今作は、生楽器、生演奏、生録音にこだわり、より躍動感と空気感をダイレクトに伝える作品となっており、「program music I」では非常に特徴的であったデジタルエディットは排除されています。 从简介中也可以看出来这张专辑的重心放在了乐器本身，除了一些Vocal采样基本上也没有别的电子元素了，不过这样的风格我也是超喜欢啊。如果说当年的Stella是以银河铁道之夜作为背景来谱写的话，那么与之一脉相承的便要数以星宿名命名的subaru了，在弦乐和键盘的轮番刺激下，仿佛真的有种ascension to subaru的感觉，在深夜闭眼，伴随着柏大輔在音乐中所注入的想象力一同飞向遥远的subaru，也是妙不可言的一种精神状态。整张专八支曲子，说多不多说少不少，毕竟我最喜欢的两首city in the lake和subaru可都是长达十分钟以上。。2016年有这样一张专辑的横空出世，无疑是今年最大的惊喜，不知道什么时候会出program music III呢XD。 2. YEN TOWN BAND - アイノネ其实我也不是很懂小林武史玩的到底是哪一出，竟然把这个二十年前架空的乐队又搬上了台面。回忆起当时看《好想告诉你》的时候第一次听到Chara的嗓音，真的是有点不能接受，但看完燕尾蝶之后，我又变得如此痴迷于这个随性的声音。不管怎么样，这支新歌的歌词着实让我感到了极大的正能量，就如同那首《My Way》，无论在多么黑暗辛苦的日子里，它都会化作专辑封面上的阳光，支持着我前进。 イタミもいつか 強さに変わっていくよ 事后搜寻了一番，原来是燕尾蝶也要动画化了吗？？？（【预告】岩井俊二动画新作 燕尾蝶）真是有点猝不及防。。 3. ZARD Forever Best~25th Anniversary~泉水姐姐走了也要快十年了，虽然在周年纪念时都会出这种专辑，但泉水姐姐的声音就是这么好听啊QAQ，就算再炒十年冷饭我也认了！ 4. KOKIA - The VOICE其实在此之前，我对KOKIA的印象只是停留在那首耳熟能详的ありがとう。。直到被我一个朋友安利了她三张早期具有代表性的专辑（The Voice, songbird, Real World）我才是真的成了K姐的铁杆粉。过去的一年不知道循环了多少次the voice这张专辑，能有这种让人无比放松无比舒心的歌喉与旋律，真心感谢KOKIA。一月十五号KOKIA就要在上海开演唱会了，也真的很期待233. 1人じゃないよ 何もできないけど 辛い時こそ心に 歌をかかげて がんばってほしい 乗り越えてほしい 届いてほしいこの気持ち あなたに贈る歌 私にできること —–《私にできること》 5. Yellow Magic Orchestra - Yellow Magic Orchestra 谜之彼女X中作者提及自己的偶像 神TM用口风琴吹中国女…. 坂本龙一的曲子听了很久，但坂本教授年轻时和细野晴臣高桥幸宏组的这个电子合成器风格乐队我还真是了解不多。若不是在看迷狐怪童时被植芝理一疯狂的安利和植入式广告。。我可能就会和这个乐队擦肩而过了。听完这张专辑，简直不相信是这是上个世纪七十年代的作品，虽然合成器的音色一听就很复古，旋律也稍显单调（但是魔性啊），但一想到四十年前就有这样的音乐出现，还是觉得不可思议。。感谢植芝理一老师不懈的安利，让我没有错过这一经典.. 6. 竇唯 / 譯 - 幻听窦唯这个名字之前倒是一直听说过，但印象里总是莫名的把他和林海归为一类。。大概都是名字是两个字的国人音乐人。抱着好奇的心里听了几首热门曲子，才知道我之前对他也是误解太深了。这个人是真的有才华，尤其是这个99年的专辑幻听，为什么听上去会有后摇的感觉…今年大概这就是这张专辑刷新了一个只听十一区音乐家作品的人对于大陆音乐作品的观念。 7. 藤田麻衣子 - あなたは幸せになる下半年有件很幸运的事降临在我头上，在网易云偶然一次的转发竟然真的让我中了藤田麻衣子演唱会的门票。。演唱会一开始麻衣子就唱了那首最有名ねぇ，果然在现场听这首曲子比在家里用耳机听声场大了无数倍，真的是一种享受，一度泪目。演唱会中间麻衣子和小提琴手natsumi也让大家一起学了几个简单的舞蹈动作，唱了一些欢快的歌曲。不过作为治愈系女歌手麻衣子还是在最后安可曲时放了一个大招，就是这首我之前没听过的 あなたは幸せになる。为什么说是大招呢..因为麻衣子这首歌后半部分是走下电钢琴，拿掉麦克风用清声唱给大家听的，仿佛就是一个你多年的好朋友在你耳旁轻声为你献上了她最真挚的祝福，太感动了T_T。 あなたは幸せになる だってつらいこと たくさんがんばった 不安に潰されそうな 一人の夜もあるけれど 負けないで 8. 手嶌葵 - Aoi Works 〜best collection 2011-2016〜手嶌葵的声音在我眼里它就是一种乐器，不管唱的如何，听上去就和BGM一样。所以很适合学习工作的时候就这样随机播放着，也不用去刻意听歌词说了啥。上半年的时候我还是挺喜欢手嶌葵的歌的，七月份来上海的演唱会也去了，在现场听さよならの夏确实不错..但她的歌听多了总觉得少了点什么，直到我听了KOKIA和藤田麻衣子的歌才发现，在感情表达这一方面，手嶌葵还是有些欠缺。她的歌拿来当BGM是再合适不过的了，但要专门去欣赏，去聆听，就会觉得少了很多内涵上的东西。虽然话是这么说，我还是非常喜欢她的歌。。（并不是傲娇x）今年的新曲《明日への手紙》算是近年来很不错的作品了。说起来手嶌葵的演唱会就只有一架钢琴作为伴奏，比起麻衣子演唱会台上的架子鼓+小提琴+键盘+贝斯，真是足够简约了， 9. 菅野洋子 - Cowboy Bebop: Blue说来惭愧，16年我才把渡边信一郎那两部最脍炙人口的经典混沌武士+星际牛仔看完了。不过在成年过后才接触到这两部动画，某种程度上倒也是种幸运，一是不至于很多桥段上看不懂，二是对于经历过一些事情的人来说，某些情节也会更有味道。二十六集的星际牛仔，菅野洋子为此打造了和故事风格很搭配的爵士配乐，于是CB在观感还是听觉上都给了观众一种很强的沉浸感，五星的动画中菅野大神的配乐占两星真的不为过，回味无穷，看完动画的那一周都在循环这张专辑。。若是拿一首歌来诠释Spike的一生我想还是这张官方专辑里的Blue最为合适，“我只是想确认一下我是不是在梦里”。 Everything is clearer now Life is just a dream, you know that’s never ending —–《Blue》 10. 小濑村晶 - Memories of the Beginning2016年刚刚认识的一位音乐人，小濑村晶。因为他的作品专辑封面才关注到了他，封面一般都是些很日系小清新的摄影，也是很符合他的音乐风格。像他这种风格的轻音乐听得实在是太多了，但还是无法抵抗， 特别是《虹の彼方》这种简洁的编曲+梦幻般的人声，实在也是很适合当做日常BGM来使用呀。 見上げた空の その先にある 虹の彼方へゆく 二人で 想い描いた 僕らの未来 ここからきっと はじめよう —–虹の彼方 凑完这十张专辑之后来看，感觉过去的一年听得音乐也不算很多，可能是喜欢单曲循环的缘故吧。大部分都是些日常BGM向温柔的曲风，毕竟现实已经这么残酷了，对我来说，唯有音乐才能让我从一大堆琐事中解放出来。希望17年也有更多我喜欢的音乐人多出新作XD，がんばってね。","tags":[{"name":"music","slug":"music","permalink":"http://yoursite.com/tags/music/"}]},{"title":"「ただ」「ただし」「もっとも」","date":"2016-09-28T16:00:00.000Z","path":"2016/09/29/but/","text":"转载自百度文库 这三个接续词都用于对前面叙述的内容进行补充说明的场合。都可以翻译成“但是”、“然而”、“不过”等意思，但是，他们使用的场合并不完全相同。「ただ」：用于基本承认前面的内容，但感到还不充分，需要补充个别的例外情况和对存在的次要问题进行注释，或必须告知对方的事项等。 ★日曜日なら休みだが、ただ、家にいるときはかぎらないよ。 （星期天是休息，可是不一定在家。） ★いいところだが、ただ不便な点は玉にきずだ。 （是个好地方，不过美中不足的是不方便。） 「ただし」：用于基本承认前面叙述的事项，但前面句子陈述的事项不是百分之百的适用，要补充一些条件、限制和例外的情况，要添加使之适用的条件或限制。与「ただ」比较，「ただし」表示前面叙述的事项不能通用与一切场合，须增加相应的条件或限制。而「ただ」表示在后句补充和前句的评价内容相反的问题。 ★手術をすれば完治するが、ただし専門医がいるかどうかはしりませんよ。 （要是做手术是可以治好的，但是不知道有没有专治这种病的医生。） ★手術をすれば完治するが、ただ問題はこの村には専門医がいないとういうことだ。 （要是做手术是可以治好的，但问题是听说这个村里没有治这种病的专门医生。） ★彼はいい男だが、ただ酒癖の悪いのが欠点だ。 （他是个好人，不过撒酒疯是个缺点。） ★彼はいい男だが、ただし酒癖はよくないよ。 （他是个好人，不过酒品不好。） 上述用的「ただし」的两句是对前项内容赋予客观条件，而用「ただ」的两句是补充一些和前项内容相反的问题。因此下面和评价问题无关的例句只能使用「ただし」，而不能使用「ただ」。 ★展覧会は午前９時より、午後４時まで。ただし、入場者が多数の場合は会場整理のため一時入場をお断りすることがあります。 ★明日は文化祭のため授業はありません。ただし、係りの生徒は７時までに登校すること。 ★店員募集。ただし高卒以上の男性。（招收店员，不过要高中毕业以上的男性。） 「もっとも」：和「ただし」一样，也表示对前面叙述的事项补充一些条件、限制和例外的情况。但是，「もっとも」在后句中附加的基本都是否定前项内容的场合、条件或事实。因此，前句叙述的事项不是决定性的。「ただし」在后句中附加的内容也可以是否定前项的场合、条件，也可以是基本肯定前项内容而提出的一些限制。 下面的「もっとも」和「ただし」都附加以否定前项内容的场合、条件，因此二者可以互换。 ★遊びに行きなさい。（もっとも／ただし）、歩いていくのがいやなら行かなくてもいい。（去玩吧。不过，不想走着去的话，不去也可以。） ★このテープで勉強すれば英会話が上達することは請け合いだ。（もっとも／ただし）例外はあるが。（保证用这种磁带学习提高英语会话能力，不过也有例外。） 下面的「ただし」在承认前项内容的基础上附加以种种限制，因此不能与「もっとも」替换。 ★遊びに行ってもいいよ。ただし、お昼には帰っていらっしゃい。（可以去玩，不过中午要回来。） ★遊びに行きなさい。ただし、歩いて行きなさい。（去玩吧，不过步行去。）","tags":[{"name":"japanese","slug":"japanese","permalink":"http://yoursite.com/tags/japanese/"}]},{"title":"日语笔记 3","date":"2016-08-06T14:57:00.000Z","path":"2016/08/06/nihongo3/","text":"1. しょっちゅう 经常，总是，老是。（ある物事が絶えず繰り返されるさま。いつも。常に。始終 ）。 彼はしょっちゅう勉強している。 他经常用功学习。 私はしょっちゅう人の名前を忘れる。 我老是忘记别人的名字。 2. 悪乗り【わるのり】 趁机胡闹，胡来。（調子に乗って、度を越えたことを、言ったりしたりすること。） あんまり悪乗りをすると、人に嫌がられるぞ。闹过头小心遭人讨厌哦。 3. 穴場【あなば】 1.（一般人不知道的）好地方。（他の人がまだ着目していない、良い釣り場所。） はぜ釣りの穴場。/钓虾虎的好地方。 2.售马票处。（馬券売り場。） ニューヨークの穴場を彼に案内してもらった。/请他把我领到纽约的售马票处。 4. ごちゃごちゃ 乱糟糟，乱七八糟。（種々のものが乱雑にはいりまじっているさま。） ごちゃごちゃした街。/乱糟糟的街道。 ごちゃごちゃに押しこむ。/乱七八糟地塞进去。 ごちゃごちゃに積んである。/杂乱无章地堆着。 5. 伸び伸び【のびのび】 1.生长茂盛，欣欣向荣。（すくすく伸びるさま。） 輝く春の日の下に青草が伸び伸びと萌えていた。/春日下青草萌发出嫩芽。 2.悠闲，悠然自得。（押さえられることもなく、ゆったりと落ち着きのあるさま。） 伸び伸びと仕事をする。/悠闲地工作。 いなかに来て伸び伸びとした気分にひたる。/来到乡村心情悠然自得。 6. 惚気【のろけ】 1.津津乐道地讲自己和爱人的无聊事。（のろけること。また、その話。） お惚気にあてられる。/厌烦别人讲他与他爱人的无聊事。。 7. 悪くすると【わるくすると】 （预想结果不好）说不定,也许. 悪くするときょうは1日中雨ですよ／今天也许要下一天雨. 悪くすると留年だ／说不定要留级. 悪くすると失敗かも知れん／弄不好说不定要失败.","tags":[{"name":"japanese","slug":"japanese","permalink":"http://yoursite.com/tags/japanese/"}]},{"title":"日语笔记 2","date":"2016-07-28T15:57:00.000Z","path":"2016/07/28/nihongo2/","text":"1. いよいよ 【词义1】表示程度的急剧提高、事态变化非常显著。例：台風が近付いて、風がいよいよ強くなってきた。台风临近，风越来越大了。 【词义2】表示事态发展到最后阶段、与它事物的临界点。例：楽しかった夏休みもいよいよ終わりに近付いた。愉快的暑假就要接近尾声了。 【词义3】以固定形式表示紧要关头。例：いよいよの時には、これを使ってください。到紧要关头的时候，请使用这个。 2. 目覚める【めざめる】 （1）睡醒,觉醒.朝早く目覚める／早晨很早睡醒. （2）〔自覚する〕自觉;醒悟,觉醒.愛校心に目覚める／在爱校心上有所觉悟.翻然と目覚めて社会主義建設のために奉仕する／翻然悔悟,为建设社会主义服务. （3）〔意識する〕发生,发动.民族意識に目覚める／有了民族意识.性に目覚める／春情发动. 3. 新米【しんまい】 1.（当年收的）新米。（その年に収穫した米。） 2.新手，新参加的人。生手。刚开始做某事项还不习惯的人，还不熟练的人。（まだ始めたばかりで、その事柄に慣れていない人。未熟な人。）新米の先生。/新上任的老师。この商売では新米です。/做这行买卖是生手。 4. 無茶【むちゃ】 1.【形動】 ;毫无道理，岂有此理『成』。胡乱，胡来，乱来。（道理に合わないこと。乱暴）まったく無茶だ/简直岂有此理。無茶を言って人を困らす/讲些毫无道理的话使人为难。無茶を言う/胡说八道；说废话。無茶をやる/胡闹；做荒唐的事。無茶なまねはよせ/不要胡来。無茶な飲み食い/胡吃乱喝。無茶なことを言うな/别胡说八道。無茶に金をつかう/乱花钱。 2.离谱，格外。（坏的）程度不寻常。（程度が尋常でないこと）無茶な高値/贵得离谱。無茶な食べ方/过分的饮食方法。無茶なダイエット/过分的节食减肥。 5. 投げ遣り【なげやり】马虎，草率，随便。（物事をいい加減な態度で行うこと。どうなってもいいというような無責任な態度であること。また，そのさま。）仕事が投げ遣りだ。/工作马虎。投げ遣りな態度ではなにごともできない。/态度马马虎虎,什么事情也干不成。。 6. 引きこもり【ひきこもり】长期闭门不出，拒绝接触他人和社会的生活状态。家里蹲。社会问题之一。（自宅や自室に長期間とじこもり、他人や社会と接触しないで生活する状態。1990年代に青少年の間で増加し社会問題化。）6年間引きこもりだった。/6年间闭门不出。","tags":[{"name":"japanese","slug":"japanese","permalink":"http://yoursite.com/tags/japanese/"}]},{"title":"日语笔记 1","date":"2016-07-27T16:00:00.000Z","path":"2016/07/28/nihongo1/","text":"1. イチャイチャhttp://jp.hjenglish.com/new/p441648/kiss 2. 手遅れhttp://dict.hjenglish.com/jp/jc/%E6%89%8B%E9%81%85%E3%82%8C为时已晚 3. めちゃめちゃhttp://dict.hjenglish.com/jp/jc/%E3%82%81%E3%81%A1%E3%82%83%E3%82%81%E3%81%A1%E3%82%83 4. 常に(つねに)【副词】 常，时常，经常；不断；总，老。 5. 近く(ちかく) 近处，近旁，附近。（そば。）近くの家。/附近的房屋。駅の近くにある。/在车站附近。近くの店で買い物をする。/在附近的商店买东西。学校のすぐ近くに住む。/住在学校的近旁。 不久，近期，即将。（近い将来。）近くそうなる。/不久会是那样。近く行われる会議。/即将召开的会议。 近乎，将近，几乎，快，快了le。（ほぼ。）夕刻近くに。/在快到傍晚时分。5千円近くある。/有将近五千日元。もう3年近くになる。/已经快三年了。 6. ちなみに【接续】 顺便，附带。 7. 日语中数词和送气音之间的规律是怎样的？https://www.zhihu.com/question/46697543 8. れっきとした的确 9. ちなみにby the way 10. 真剣になる认真","tags":[{"name":"japanese","slug":"japanese","permalink":"http://yoursite.com/tags/japanese/"}]},{"title":"摄影手札 1","date":"2016-05-19T07:16:52.000Z","path":"2016/05/19/Picture-Test/","text":"自从今年三月份购买相机之后，也过去了两个月。大概也是因为刚接触摄影的缘故，热情是非常高涨，凡是有晴朗的天气便在室内呆不下，快门数也是不断的上涨。方才数了下照片明明，至今天已经到了548了，虽然这个数量在很多人看来也还是少得可怜，但这两个月的实践+学习的过程中，我应该也算是摸到一点摄影的门路，借此新博客的开通，在这里总结一下过去这两个月的心路历程。 先放一下我的500px地址：https://500px.com/fhiutc 感觉好的照片都已经传上去了，有一张也达到了90+的脉动（虽然自己现在看来非常烂。。） 这是我摸到相机后第二天拍的。学校里最富有自然气息的地方便要数学校后的小河，经常也会有龙舟队的队员来此处训练。本来只是想拍一下龙舟，回来在电脑上一看似乎构图还不错便粗粗的修了一下。这个色调并不是自己调的，而是lightroom自带的古极线预设风格，套用上一看感觉还不错。当然现在看觉得滤镜的味道太重了，可以说是色温错的不行，虽然有一种『古』的氛围，但画面上很多地方都出现了色差，远处的楼房都变成了淡粉色。。 - 一天放学时路过学校的菜地，一束特别高耸的狗尾巴草吸引了我的注意，在夕阳的映衬下，自然而然让我想起了逆光下植物的一轮金圈。以前一直都是开小光圈拍风景，这张照片是我第一次感受到大光圈背景虚化的魅力。后来了解到有一支老镜头叫『八羽怪』，看了下样张局旋转焦外十分迷人，价钱也并不是很贵，以后可能会入一支玩一玩XD - 这张是清明节的时候和朋友去学校不远处的东海观海公园踏青时拍摄的，当时拍了很多。唯独放着一张上来的原因是这是我照片中难得一张有人上镜的照片。。当时朋友在拍飞机，我看这一场景莫名觉得有一种童趣便偷拍了他233。原图有点灰蒙蒙的，在lightroom里拉了一下鲜艳度，照片立马就亮了起来。。我对于这种飞机的喜爱大概是源于新海诚的《云之彼端、约束的地方》，这是我看的第一部新海诚电影，虽然这部电影叙事乱成一麻，但其中所描绘优美的景色和出色的配乐还是能让我时至今日都还常常回想起它。 - 这张作为封面的是我这两个月比较满意的成品。这次没有以前那么光秃秃的三分地平线的风景图，而是有了前景意识，加了河畔的芦苇在前。 - 这是前几天和同学骑车又去东海玩的时候拍摄的，第一次尝试剪影+倾斜构图，看效果还算不错。但总感觉下方一大片的死黑让人有点难受，又不知如何调整。。海边的天空总是让人迷醉，深蓝和橙黄的间的渐变色也是让我欣赏了很久。 拍了五百多张图，选出了五张摆在这里。。好像成片率还可以（我懒）。 要说这两个月中对于摄影的一个最大的认识，便是后期。对于我一个计算机专业的学生来说，相比较摄影系科班学生，可能还是在电脑后期上下功夫更加的吸引我。这当然不是只因为这一点，当我第一次拉动鲜艳度把一张灰蒙蒙的照片转变的活灵活现的时候，我便感受到后期的威力所在，这真的是可以很大程度上弥补拍摄者自身水平的一个利器。所以关于摄影书籍我主要看的是关于后期技术和提高摄影品味的书。确实有很大的收获。 最后推荐几个摄影网站： 500px 1x 国家地理 在知乎上看到过一句话，你接触的摄影作品会在潜意识中影响你自己的作品。多接触高水平的摄影作品不管是提升自己品味还是欣赏地球上的大千世界，也都是很有帮助的呢。","tags":[{"name":"Photography","slug":"Photography","permalink":"http://yoursite.com/tags/Photography/"}]},{"title":"Hello World","date":"2016-05-17T16:00:00.000Z","path":"2016/05/18/Hello/","text":"Hello World!","tags":[]}]